In [1]:
import pandas as pd

In [2]:
obj = pd.Series([4,7,-5,3])

In [9]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [10]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [11]:
obj2 = pd.Series([4,7,-5,3], index=['d','b','a','c'])

In [12]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [13]:
obj2['d']

4

In [14]:
obj2[['d','c']]

d    4
c    3
dtype: int64

In [15]:
obj2*5

d    20
b    35
a   -25
c    15
dtype: int64

In [16]:
sdata = {'Ohio': 35000,
        'Texas': 71000,
        'Oregon': 16000,
        'Utah': 5000}

In [17]:
sdata

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [18]:
obj3 = pd.Series(sdata)

In [19]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [20]:
states=['California', 'Ohio', 'Oregon', 'Texas']

In [22]:
obj4=pd.Series(sdata, index=states)

In [23]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [25]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [26]:
obj3+obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [27]:
# DataFrames

data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
'year': [2000, 2001, 2002, 2001, 2002],
'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}

In [29]:
frame=pd.DataFrame(data)

In [30]:
frame.values

array([['Ohio', 2000, 1.5],
       ['Ohio', 2001, 1.7],
       ['Ohio', 2002, 3.6],
       ['Nevada', 2001, 2.4],
       ['Nevada', 2002, 2.9]], dtype=object)

In [31]:
frame.index

RangeIndex(start=0, stop=5, step=1)

In [32]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [36]:
frame2=pd.DataFrame(data, columns=['year','state','pop','debt'], index=['one', 'two', 'three', 'four', 'five'])

In [37]:
frame2['debt'] = 20

In [38]:
val=pd.Series([4,8,12], index=['one', 'two', 'five'])

In [43]:
frame2['debt']=val

In [44]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   4.0
two    2001    Ohio  1.7   8.0
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4   NaN
five   2002  Nevada  2.9  12.0

In [47]:
frame2['debt'].isnull()

one      False
two      False
three     True
four      True
five     False
Name: debt, dtype: bool

In [48]:
# Filter conditional and assing it to a new attribute
frame2['eastern']=frame2.state=='Nevada'

In [49]:
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   4.0    False
two    2001    Ohio  1.7   8.0    False
three  2002    Ohio  3.6   NaN    False
four   2001  Nevada  2.4   NaN     True
five   2002  Nevada  2.9  12.0     True

In [50]:
# Delete column from DF
del frame2['eastern']

In [51]:
# Fill columns with NaN with zero value
frame2['debt'].fillna(0, inplace=True)

In [52]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   4.0
two    2001    Ohio  1.7   8.0
three  2002    Ohio  3.6   0.0
four   2001  Nevada  2.4   0.0
five   2002  Nevada  2.9  12.0

In [53]:
frame2.dtypes

year       int64
state     object
pop      float64
debt     float64
dtype: object

In [54]:
frame2.shape

(5, 4)

In [55]:
pop={'Nevada': {2001: 2.4, 2002: 2.9},
'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [56]:
pop

{'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [65]:
frame3=pd.DataFrame(pop)

In [66]:
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [67]:
# Transposition operation
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [68]:
pd.DataFrame(pop, index=[2001, 2002, 2005])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2005     NaN   NaN

In [71]:
frame3.index.name='year'; frame3.columns.name='state'

In [72]:
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5